import lesson

# Первая неделя
first_week_lessons = [
# Понедельник
[
lesson.lesson("Право", "Сотникова Л. В.", "А-13", "11:20", "12:50"),
lesson.lesson("Современные технологии поиска", "", "А-17", "13:15", "14:45")
],
# Вторник
[
lesson.lesson("Дискретная математика", "Шалагинов Л. В.", "132", "13:15", "14:45"),
lesson.lesson("Математический анализ", "Шуклина А. Ф.", "А-13", "15:00", "16:30"),
lesson.lesson("Физкультура", "Ярушин С. А.", "А-13", "16:40", "18:10")
],
# Среда
[
lesson.lesson("Английский (2 группа)", "Викторова Е. В.", "011", "11:20", "12:50"),
lesson.lesson("Информатика", "Николаев И. Е.", "132", "13:15", "14:45"),
lesson.lesson("Физика", "Бутько Л. Н.", "429", "15:00", "16:30"),
lesson.lesson("Линейная Алгебра", "Митина О. В.", "А-17", "16:40", "18:10")
],
# Четверг
[
lesson.lesson("Английский (1 группа)", "Ковальчук Л. П.", "011", "8:00", "9:30"),
lesson.lesson("Английский (1 группа)", "Ковальчук Л. П.", "011", "9:40", "11:10"),
lesson.lesson("Физра", "Панькин В. Е.", "", "11:20", "12:50")
],
# Пятница
[
lesson.lesson("Физика", "Бутько Л. Н.", "132", "8:00", "9:30"),
lesson.lesson("Дискретная математика", "Шалагинов Л. В.", "А-17", "9:40", "11:10"),
lesson.lesson("Математический анализ", "Ижбердеева Е. М.", "427", "11:20", "12:50"),
lesson.lesson("Линейная алгебра", "Тюрина И. А.", "429", "13:15", "14:45")
],
# Суббота
[
lesson.lesson("Программирование", "Кирсанов А. А.", "", "12:00", "13:30"),
lesson.lesson("Программирование", "Кирсанов А. А.", "", "15:00", "16:30")
]
]



# Вторая неделя
second_week_lessons = [
# Понедельник
[
lesson.lesson("История", "Бадиков Р. А.", "А-25", "9:40", "11:10"),
lesson.lesson("Информатика", "Николаев И. Е.", "А-17", "11:20", "12:50"),
lesson.lesson("Английский (2 группа)", "Викторова Е. В.", "132-Б", "13:15", "14:45")
],
# Вторник
[
lesson.lesson("Дискретная математика", "Шалагинов Л. В.", "132", "11:20", "12:50"),
lesson.lesson("Дискретная математика", "Шалагинов Л. В.", "132", "13:15", "14:45"),
lesson.lesson("Математический анализ", "Шуклина А. Ф.", "А-13", "15:00", "16:30"),
lesson.lesson("Физкультура", "Ярушин С. А.", "А-13", "16:40", "18:10")
],
# Среда
[
lesson.lesson("Физика", "Бутько Л. Н.", "А-17", "15:00", "16:30"),
lesson.lesson("Линейная Алгебра", "Митина О. В.", "А-17", "16:40", "18:10")
],
# Четверг
[
lesson.lesson("Английский (1 группа)", "Ковальчук Л. П.", "011", "9:40", "11:10"),
lesson.lesson("Физра", "Панькин В. Е.", "", "11:20", "12:50")
],
# Пятница
[
lesson.lesson("Английский (2 группа)", "Викторова Е. В.", "013", "9:40", "11:10"),
lesson.lesson("Математический анализ", "Ижбердеева Е. М.", "427", "11:20", "12:50"),
lesson.lesson("Линейная алгебра", "Тюрина И. А.", "429", "13:15", "14:45")
],
# Суббота
[
lesson.lesson("Программирование", "Кирсанов А. А.", "", "12:00", "13:30"),
lesson.lesson("Программирование", "Кирсанов А. А.", "", "15:00", "16:30")
]
]